In [1]:
!pip install requests bs4 scikit-learn tweepy kiwipiepy IPython

Collecting requests
  Using cached requests-2.32.3-py3-none-any.whl.metadata (4.6 kB)
Collecting bs4
  Using cached bs4-0.0.2-py2.py3-none-any.whl.metadata (411 bytes)
Collecting scikit-learn
  Downloading scikit_learn-1.6.1-cp311-cp311-win_amd64.whl.metadata (15 kB)
Collecting tweepy
  Downloading tweepy-4.15.0-py3-none-any.whl.metadata (4.1 kB)
Collecting kiwipiepy
  Downloading kiwipiepy-0.21.0-cp311-cp311-win_amd64.whl.metadata (1.3 kB)
Requirement already satisfied: IPython in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (9.2.0)
Collecting charset-normalizer<4,>=2 (from requests)
  Downloading charset_normalizer-3.4.2-cp311-cp311-win_amd64.whl.metadata (36 kB)
Collecting idna<4,>=2.5 (from requests)
  Using cached idna-3.10-py3-none-any.whl.metadata (10 kB)
Collecting urllib3<3,>=1.21.1 (from requests)
  Using cached urllib3-2.4.0-py3-none-any.whl.metadata (6.5 kB)
Collecting certifi>=2017.4.17 (from requests)
  Downloading certifi-2025.4.26-py3-none-any.whl.metadata (2.5 kB)
Collecting beautifulsoup4 (from bs4)
  Downloading beautifulsoup4-4.13.4-py3-none-any.whl.metadata (3.8 kB)
Collecting numpy>=1.19.5 (from scikit-learn)
  Downloading numpy-2.2.5-cp311-cp311-win_amd64.whl.metadata (60 kB)
Collecting scipy>=1.6.0 (from scikit-learn)
  Downloading scipy-1.15.2-cp311-cp311-win_amd64.whl.metadata (60 kB)
Collecting joblib>=1.2.0 (from scikit-learn)
  Downloading joblib-1.5.0-py3-none-any.whl.metadata (5.6 kB)
Collecting threadpoolctl>=3.1.0 (from scikit-learn)
  Downloading threadpoolctl-3.6.0-py3-none-any.whl.metadata (13 kB)
Collecting oauthlib<4,>=3.2.0 (from tweepy)
  Downloading oauthlib-3.2.2-py3-none-any.whl.metadata (7.5 kB)
Collecting requests-oauthlib<3,>=1.2.0 (from tweepy)
  Downloading requests_oauthlib-2.0.0-py2.py3-none-any.whl.metadata (11 kB)
Collecting kiwipiepy_model<0.22,>=0.21 (from kiwipiepy)
  Downloading kiwipiepy_model-0.21.0.tar.gz (35.5 MB)
     ---------------------------------------- 0.0/35.5 MB ? eta -:--:--
     -- ------------------------------------- 2.4/35.5 MB 11.2 MB/s eta 0:00:03
     ----- ---------------------------------- 4.7/35.5 MB 11.4 MB/s eta 0:00:03
     ------- -------------------------------- 7.1/35.5 MB 11.2 MB/s eta 0:00:03
     ---------- ----------------------------- 9.4/35.5 MB 11.3 MB/s eta 0:00:03
     ------------ -------------------------- 11.8/35.5 MB 11.4 MB/s eta 0:00:03
     --------------- ----------------------- 14.2/35.5 MB 11.2 MB/s eta 0:00:02
     ------------------ -------------------- 16.8/35.5 MB 11.4 MB/s eta 0:00:02
     --------------------- ----------------- 19.1/35.5 MB 11.3 MB/s eta 0:00:02
     ----------------------- --------------- 21.5/35.5 MB 11.3 MB/s eta 0:00:02
     -------------------------- ------------ 23.9/35.5 MB 11.3 MB/s eta 0:00:02
     ---------------------------- ---------- 26.2/35.5 MB 11.3 MB/s eta 0:00:01
     ------------------------------- ------- 28.8/35.5 MB 11.4 MB/s eta 0:00:01
     ---------------------------------- ---- 31.2/35.5 MB 11.3 MB/s eta 0:00:01
     ------------------------------------ -- 33.6/35.5 MB 11.3 MB/s eta 0:00:01
     --------------------------------------- 35.5/35.5 MB 11.2 MB/s eta 0:00:00
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Collecting tqdm (from kiwipiepy)
  Using cached tqdm-4.67.1-py3-none-any.whl.metadata (57 kB)
Requirement already satisfied: colorama in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (0.4.6)
Requirement already satisfied: decorator in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (5.2.1)
Requirement already satisfied: ipython-pygments-lexers in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (1.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (0.1.7)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (3.0.51)
Requirement already satisfied: pygments>=2.4.0 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (2.19.1)
Requirement already satisfied: stack_data in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (5.14.3)
Requirement already satisfied: typing_extensions>=4.6 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (4.13.2)
Requirement already satisfied: wcwidth in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from prompt_toolkit<3.1.0,>=3.0.41->IPython) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from jedi>=0.16->IPython) (0.8.4)
Collecting soupsieve>1.2 (from beautifulsoup4->bs4)
  Downloading soupsieve-2.7-py3-none-any.whl.metadata (4.6 kB)
Requirement already satisfied: executing>=1.2.0 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from stack_data->IPython) (2.2.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from stack_data->IPython) (3.0.0)
Requirement already satisfied: pure-eval in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from stack_data->IPython) (0.2.3)
Using cached requests-2.32.3-py3-none-any.whl (64 kB)
Downloading charset_normalizer-3.4.2-cp311-cp311-win_amd64.whl (105 kB)
Using cached idna-3.10-py3-none-any.whl (70 kB)
Using cached urllib3-2.4.0-py3-none-any.whl (128 kB)
Using cached bs4-0.0.2-py2.py3-none-any.whl (1.2 kB)
Downloading scikit_learn-1.6.1-cp311-cp311-win_amd64.whl (11.1 MB)
   ---------------------------------------- 0.0/11.1 MB ? eta -:--:--
   ------- -------------------------------- 2.1/11.1 MB 11.8 MB/s eta 0:00:01
   ---------------- ----------------------- 4.7/11.1 MB 11.4 MB/s eta 0:00:01
   ------------------------- -------------- 7.1/11.1 MB 11.5 MB/s eta 0:00:01
   --------------------------------- ------ 9.4/11.1 MB 11.3 MB/s eta 0:00:01
   ---------------------------------------- 11.1/11.1 MB 11.1 MB/s eta 0:00:00
Downloading tweepy-4.15.0-py3-none-any.whl (99 kB)
Downloading oauthlib-3.2.2-py3-none-any.whl (151 kB)
Downloading requests_oauthlib-2.0.0-py2.py3-none-any.whl (24 kB)
Downloading kiwipiepy-0.21.0-cp311-cp311-win_amd64.whl (2.4 MB)
   ---------------------------------------- 0.0/2.4 MB ? eta -:--:--
   ---------------------------------------  2.4/2.4 MB 11.2 MB/s eta 0:00:01
   ---------------------------------------- 2.4/2.4 MB 10.6 MB/s eta 0:00:00
Downloading certifi-2025.4.26-py3-none-any.whl (159 kB)
Downloading joblib-1.5.0-py3-none-any.whl (307 kB)
Downloading numpy-2.2.5-cp311-cp311-win_amd64.whl (12.9 MB)
   ---------------------------------------- 0.0/12.9 MB ? eta -:--:--
   ------- -------------------------------- 2.4/12.9 MB 11.2 MB/s eta 0:00:01
   -------------- ------------------------- 4.7/12.9 MB 11.4 MB/s eta 0:00:01
   --------------------- ------------------ 7.1/12.9 MB 11.5 MB/s eta 0:00:01
   ----------------------------- ---------- 9.4/12.9 MB 11.3 MB/s eta 0:00:01
   ------------------------------------ --- 11.8/12.9 MB 11.4 MB/s eta 0:00:01
   ---------------------------------------- 12.9/12.9 MB 11.1 MB/s eta 0:00:00
Downloading scipy-1.15.2-cp311-cp311-win_amd64.whl (41.2 MB)
   ---------------------------------------- 0.0/41.2 MB ? eta -:--:--
   -- ------------------------------------- 2.4/41.2 MB 11.2 MB/s eta 0:00:04
   ---- ----------------------------------- 4.7/41.2 MB 11.4 MB/s eta 0:00:04
   ------ --------------------------------- 7.1/41.2 MB 11.5 MB/s eta 0:00:03
   --------- ------------------------------ 9.4/41.2 MB 11.3 MB/s eta 0:00:03
   ----------- ---------------------------- 12.1/41.2 MB 11.4 MB/s eta 0:00:03
   ------------- -------------------------- 14.4/41.2 MB 11.3 MB/s eta 0:00:03
   ---------------- ----------------------- 16.8/41.2 MB 11.4 MB/s eta 0:00:03
   ------------------ --------------------- 19.1/41.2 MB 11.4 MB/s eta 0:00:02
   --------------------- ------------------ 21.8/41.2 MB 11.4 MB/s eta 0:00:02
   ----------------------- ---------------- 24.1/41.2 MB 11.4 MB/s eta 0:00:02
   ------------------------- -------------- 26.5/41.2 MB 11.3 MB/s eta 0:00:02
   --------------------------- ------------ 28.8/41.2 MB 11.4 MB/s eta 0:00:02
   ------------------------------ --------- 31.5/41.2 MB 11.3 MB/s eta 0:00:01
   -------------------------------- ------- 33.8/41.2 MB 11.4 MB/s eta 0:00:01
   ----------------------------------- ---- 36.2/41.2 MB 11.4 MB/s eta 0:00:01
   ------------------------------------- -- 38.5/41.2 MB 11.3 MB/s eta 0:00:01
   ---------------------------------------  41.2/41.2 MB 11.4 MB/s eta 0:00:01
   ---------------------------------------- 41.2/41.2 MB 11.2 MB/s eta 0:00:00
Downloading threadpoolctl-3.6.0-py3-none-any.whl (18 kB)
Downloading beautifulsoup4-4.13.4-py3-none-any.whl (187 kB)
Downloading soupsieve-2.7-py3-none-any.whl (36 kB)
Using cached tqdm-4.67.1-py3-none-any.whl (78 kB)
Building wheels for collected packages: kiwipiepy_model
  Building wheel for kiwipiepy_model (pyproject.toml): started
  Building wheel for kiwipiepy_model (pyproject.toml): finished with status 'done'
  Created wheel for kiwipiepy_model: filename=kiwipiepy_model-0.21.0-py3-none-any.whl size=35593254 sha256=1346bd13ede667a374616c0b15b483892fa534bb3ac8023dd88e80376d5e2c90
  Stored in directory: c:\users\tpals\appdata\local\pip\cache\wheels\b0\16\3d\95053ab5298f0f0f22ffea6de0200b6f24bffb73cab4c1a828
Successfully built kiwipiepy_model
Installing collected packages: kiwipiepy_model, urllib3, tqdm, threadpoolctl, soupsieve, oauthlib, numpy, joblib, idna, charset-normalizer, certifi, scipy, requests, kiwipiepy, beautifulsoup4, scikit-learn, requests-oauthlib, bs4, tweepy

   ----------------------------------------  0/19 [kiwipiepy_model]
   -- -------------------------------------  1/19 [urllib3]
   -- -------------------------------------  1/19 [urllib3]
   ---- -----------------------------------  2/19 [tqdm]
   ---- -----------------------------------  2/19 [tqdm]
   -------- -------------------------------  4/19 [soupsieve]
   ---------- -----------------------------  5/19 [oauthlib]
   ---------- -----------------------------  5/19 [oauthlib]
   ---------- -----------------------------  5/19 [oauthlib]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   -------------- -------------------------  7/19 [joblib]
   -------------- -------------------------  7/19 [joblib]
   -------------- -------------------------  7/19 [joblib]
   -------------- -------------------------  7/19 [joblib]
   ---------------- -----------------------  8/19 [idna]
   ------------------ ---------------------  9/19 [charset-normalizer]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ------------------------- -------------- 12/19 [requests]
   --------------------------- ------------ 13/19 [kiwipiepy]
   ----------------------------- ---------- 14/19 [beautifulsoup4]
   ----------------------------- ---------- 14/19 [beautifulsoup4]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------------- -- 18/19 [tweepy]

In [2]:
!pip install scipy numpy matplotlib seaborn statsmodels openpyxl

Requirement already satisfied: scipy in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (1.15.2)
Requirement already satisfied: numpy in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (2.2.5)
Collecting matplotlib
  Downloading matplotlib-3.10.1-cp311-cp311-win_amd64.whl.metadata (11 kB)
Collecting seaborn
  Downloading seaborn-0.13.2-py3-none-any.whl.metadata (5.4 kB)
Collecting statsmodels
  Downloading statsmodels-0.14.4-cp311-cp311-win_amd64.whl.metadata (9.5 kB)
Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting contourpy>=1.0.1 (from matplotlib)
  Downloading contourpy-1.3.2-cp311-cp311-win_amd64.whl.metadata (5.5 kB)
Collecting cycler>=0.10 (from matplotlib)
  Using cached cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib)
  Downloading fonttools-4.57.0-cp311-cp311-win_amd64.whl.metadata (104 kB)
Collecting kiwisolver>=1.3.1 (from matplotlib)
  Downloading kiwisolver-1.4.8-cp311-cp311-win_amd64.whl.metadata (6.3 kB)
Requirement already satisfied: packaging>=20.0 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from matplotlib) (25.0)
Collecting pillow>=8 (from matplotlib)
  Downloading pillow-11.2.1-cp311-cp311-win_amd64.whl.metadata (9.1 kB)
Collecting pyparsing>=2.3.1 (from matplotlib)
  Downloading pyparsing-3.2.3-py3-none-any.whl.metadata (5.0 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from matplotlib) (2.9.0.post0)
Collecting pandas>=1.2 (from seaborn)
  Downloading pandas-2.2.3-cp311-cp311-win_amd64.whl.metadata (19 kB)
Collecting patsy>=0.5.6 (from statsmodels)
  Downloading patsy-1.0.1-py2.py3-none-any.whl.metadata (3.3 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Collecting pytz>=2020.1 (from pandas>=1.2->seaborn)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas>=1.2->seaborn)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.17.0)
Downloading matplotlib-3.10.1-cp311-cp311-win_amd64.whl (8.1 MB)
   ---------------------------------------- 0.0/8.1 MB ? eta -:--:--
   ---------- ----------------------------- 2.1/8.1 MB 11.8 MB/s eta 0:00:01
   ---------------------- ----------------- 4.5/8.1 MB 11.2 MB/s eta 0:00:01
   ----------------------------------- ---- 7.1/8.1 MB 11.5 MB/s eta 0:00:01
   ---------------------------------------- 8.1/8.1 MB 11.1 MB/s eta 0:00:00
Downloading seaborn-0.13.2-py3-none-any.whl (294 kB)
Downloading statsmodels-0.14.4-cp311-cp311-win_amd64.whl (9.9 MB)
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   --------- ------------------------------ 2.4/9.9 MB 11.2 MB/s eta 0:00:01
   ------------------- -------------------- 4.7/9.9 MB 11.4 MB/s eta 0:00:01
   ---------------------------- ----------- 7.1/9.9 MB 11.5 MB/s eta 0:00:01
   -------------------------------------- - 9.4/9.9 MB 11.5 MB/s eta 0:00:01
   ---------------------------------------- 9.9/9.9 MB 11.2 MB/s eta 0:00:00
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading contourpy-1.3.2-cp311-cp311-win_amd64.whl (222 kB)
Using cached cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.57.0-cp311-cp311-win_amd64.whl (2.2 MB)
   ---------------------------------------- 0.0/2.2 MB ? eta -:--:--
   ---------------------------------------- 2.2/2.2 MB 10.4 MB/s eta 0:00:00
Downloading kiwisolver-1.4.8-cp311-cp311-win_amd64.whl (71 kB)
Downloading pandas-2.2.3-cp311-cp311-win_amd64.whl (11.6 MB)
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   ------- -------------------------------- 2.1/11.6 MB 10.7 MB/s eta 0:00:01
   ---------------- ----------------------- 4.7/11.6 MB 11.0 MB/s eta 0:00:01
   ------------------------ --------------- 7.1/11.6 MB 11.2 MB/s eta 0:00:01
   -------------------------------- ------- 9.4/11.6 MB 11.3 MB/s eta 0:00:01
   ---------------------------------------- 11.6/11.6 MB 11.0 MB/s eta 0:00:00
Downloading patsy-1.0.1-py2.py3-none-any.whl (232 kB)
Downloading pillow-11.2.1-cp311-cp311-win_amd64.whl (2.7 MB)
   ---------------------------------------- 0.0/2.7 MB ? eta -:--:--
   ----------------------------------- ---- 2.4/2.7 MB 11.2 MB/s eta 0:00:01
   ---------------------------------------- 2.7/2.7 MB 11.0 MB/s eta 0:00:00
Downloading pyparsing-3.2.3-py3-none-any.whl (111 kB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: pytz, tzdata, pyparsing, pillow, patsy, kiwisolver, fonttools, et-xmlfile, cycler, contourpy, pandas, openpyxl, matplotlib, statsmodels, seaborn

   ----------------------------------------  0/15 [pytz]
   ----------------------------------------  0/15 [pytz]
   -- -------------------------------------  1/15 [tzdata]
   -- -------------------------------------  1/15 [tzdata]
   -- -------------------------------------  1/15 [tzdata]
   ----- ----------------------------------  2/15 [pyparsing]
   -------- -------------------------------  3/15 [pillow]
   -------- -------------------------------  3/15 [pillow]
   -------- -------------------------------  3/15 [pillow]
   -------- -------------------------------  3/15 [pillow]
   -------- -------------------------------  3/15 [pillow]
   -------- -------------------------------  3/15 [pillow]
   ---------- -----------------------------  4/15 [patsy]
   ---------- -----------------------------  4/15 [patsy]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ------------------------ ---------------  9/15 [contourpy]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ------------------------------------- -- 14/15 [seaborn]
   ------------------------------------- -- 14/15 [seaborn]
   ------------------------------------- -- 14/15 [seaborn]
   ------------------------------------- -- 14/15 [seaborn]
   ---------------------------------------- 15/15 [seaborn]

Successfully installed contourpy-1.3.2 cycler-0.12.1 et-xmlfile-2.0.0 fonttools-4.57.0 kiwisolver-1.4.8 matplotlib-3.10.1 openpyxl-3.1.5 pandas-2.2.3 patsy-1.0.1 pillow-11.2.1 pyparsing-3.2.3 pytz-2025.2 seaborn-0.13.2 statsmodels-0.14.4 tzdata-2025.2

In [4]:
import pandas as pd

sample_data = {"a":[4,5,6],
               "b":[7,8,9],
               "c":[10,11,12]}

df = pd.DataFrame(sample_data)
df_index = pd.DataFrame(sample_data, index=[1,2,3])

In [4]:
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

## PIVOT 실습
1. 데이터를 추출

In [5]:
df_1 = pd.DataFrame(
    [[4, 7, 10],
     [5, 8, 11],
     [6, 9, 12]],
     index=[1, 2, 3],
     columns=['a', 'b', 'c']
)

In [6]:
df_1

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [7]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two', 'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [8]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [9]:
df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

## CONCAT 실습
1. 데이터를 합칠 때 사용하는 함수 중 하나
2. 열 이름이 서로 일치하면 밑으로 연결됨.

3. 합쳐야 할 데이터프레임끼리 열 이름이 서로 일치하지 않다면 결측치로 처리함

In [10]:
data1 = [['a',1],
         ['b', 2]]
data2 = [['c',3],
         ['d', 4]]

df1 = pd.DataFrame(data1, columns=['letter', 'number'])
df2 = pd.DataFrame(data2, columns=['letter', 'number'])

display(df1)
display(df2)

  letter  number
0      a       1
1      b       2

  letter  number
0      c       3
1      d       4

In [11]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [12]:
df3 = pd.DataFrame([['e', 5, 'cat'], ['f', 6, 'dog']], columns=['letter', 'number', 'animal'])
pd.concat([df1, df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      e       5    cat
1      f       6    dog

In [13]:
pd.concat([df1, df3], join="inner")

  letter  number
0      a       1
1      b       2
0      e       5
1      f       6

In [14]:
df4 = pd.DataFrame([['bird' ,'polly'], ['monkey' ,'george']], columns=['animal' ,'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [15]:
#가로 방향으로 합치기 axis=1
pd.concat([df1, df4], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

## sort_value()
1. 데이터를 정렬

In [16]:
import numpy as np

df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})
display(df)

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [17]:
df.sort_values(by=['col1'])

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [18]:
df.sort_values(by=['col1'], ascending=False)

  col1  col2  col3 col4
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B
3  NaN     8     4    D

In [19]:
df.sort_values(by=['col1', 'col2'])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [20]:
df.sort_values(by='col1', ascending=False, na_position='first')

  col1  col2  col3 col4
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B

## 인덱스 재정렬

In [21]:
df = pd.DataFrame([1, 2, 3, 4, 5], index=[100, 29, 234, 1, 150], columns=['A'])
df

     A
100  1
29   2
234  3
1    4
150  5

In [22]:
df.sort_index()

     A
1    4
29   2
100  1
150  5
234  3

In [23]:
df.sort_index(ascending=False)

     A
234  3
150  5
100  1
29   2
1    4

In [27]:
#reset_index()
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                   index=['falcon', 'parrot', 'lion', 'monkey'],
                   columns=('class', 'max_speed'))

df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [30]:
df.reset_index()
#기존 인덱스가 열로 이동

    index   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [28]:
df.reset_index(drop=True)

    class  max_speed
0    bird      389.0
1    bird       24.0
2  mammal       80.5
3  mammal        NaN

## 값을 지우는 drop(), dropna()

In [31]:
df = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [32]:
df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

In [33]:
df.drop([0, 1])

   A  B   C   D
2  8  9  10  11

In [34]:
df.drop(index=[0, 1], columns=['B', 'C'])

   A   D
2  8  11

In [35]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy":[np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [np.nan, "1940-04-25", np.nan]})
df

       name        toy        born
0    Alfred        NaN         NaN
1    Batman  Batmobile  1940-04-25
2  Catwoman   Bullwhip         NaN

In [36]:
df.dropna()

     name        toy        born
1  Batman  Batmobile  1940-04-25

In [37]:
df.dropna(axis=1)

       name
0    Alfred
1    Batman
2  Catwoman

In [38]:
df.dropna(subset=['name', 'toy'])

       name        toy        born
1    Batman  Batmobile  1940-04-25
2  Catwoman   Bullwhip         NaN

#  데이터 추출
- 단순하게 데이터를 정리할 목적으로만 추출

In [3]:
import pandas as pd
df = pd.DataFrame({"ID": [1, 2, 3, 3, 5],
                   "국어": [80, 90, 75, 75, 90],
                   "영어": [85, 100, 70, 70, 95],
                   "수학": [75, 95, 65, 65, 80]})
df

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65
4   5  90   95  80

In [40]:
df[['국어', '영어']]

   국어   영어
0  80   85
1  90  100
2  75   70
3  75   70
4  90   95

In [19]:
df[df['국어'] > 80]

   ID  국어   영어  수학
1   2  90  100  95
4   5  90   95  80

In [18]:
df['국어'] > 80

0    False
1     True
2    False
3    False
4     True
Name: 국어, dtype: bool

In [16]:
df.drop_duplicates()

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
4   5  90   95  80

In [15]:
df.drop_duplicates(subset='국어')

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65

In [14]:
df.head(2)

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95

In [13]:
df.tail(2)

   ID  국어  영어  수학
3   3  75  70  65
4   5  90  95  80

In [10]:
df.sample(2)

   ID  국어  영어  수학
2   3  75  70  65
4   5  90  95  80

In [7]:
df.sample(frac=0.5)

   ID  국어  영어  수학
2   3  75  70  65
0   1  80  85  75

# iloc[]와 loc[]
1. iloc와 loc도 데이터를 행을 기준으로 추출할 때 사용하는 함수이다.
2. 이 둘의 차이점은 iloc[]는 번호를 사용해서 데이터를 추출할 인덱스와 열을 지정하고
3. loc[]는 열 이름을 지정한다.
4. iloc[행 시작 번호:행 종료 번호, 열 시작 번호:열 종료 번호]

In [29]:
df.iloc[0,2]

np.int64(85)

In [21]:
df.iloc[1:3]

   ID  국어   영어  수학
1   2  90  100  95
2   3  75   70  65

In [22]:
df.iloc[:,:]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65
4   5  90   95  80

In [30]:
df.iloc[1:4,:]

   ID  국어   영어  수학
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65

In [36]:
df.iloc[1:4,:0]

Empty DataFrame
Columns: []
Index: [1, 2, 3]

In [32]:
df.loc[:,['국어','영어']]

   국어   영어
0  80   85
1  90  100
2  75   70
3  75   70
4  90   95

In [35]:
df.loc[:0, ['국어','영어']]

   국어  영어
0  80  85

In [37]:
df.loc[df['국어']>=80, ['국어','수학']]

   국어  수학
0  80  75
1  90  95
4  90  80

# 논리 연산자
1. python -> a and b // pandas -> a & b
2. python -> a or b // pandas -> a | b
3. python -> not a // pandas -> ~ a

In [4]:
df[df['국어']==75]

   ID  국어  영어  수학
2   3  75  70  65
3   3  75  70  65

In [5]:
df[df['국어']!=75]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
4   5  90   95  80

In [6]:
df[df['국어']>=80]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
4   5  90   95  80

In [7]:
df[(df['영어']>=80)&(df['국어']>=80)]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
4   5  90   95  80

In [10]:
df[(df['수학']>=70)|(df['국어']>=80)]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
4   5  90   95  80

In [11]:
df[~(df['수학']>=70)]

   ID  국어  영어  수학
2   3  75  70  65
3   3  75  70  65

# 데이터 요약
* 요약된 데이터는 전체 데이터 특징을 간단하고 정확히 정리함.

In [13]:
import numpy as np
import pandas as pd
df = pd.DataFrame({"ID":[1, 2, 3, 4, 5],
                   "국어":[80, 90, 75, 100, 80],
                   "영어":[85, 100, 70, 70, 75],
                   "수학":[75, 95, 65, 95, np.nan]})
df

   ID   국어   영어    수학
0   1   80   85  75.0
1   2   90  100  95.0
2   3   75   70  65.0
3   4  100   70  95.0
4   5   80   75   NaN

In [14]:
df['영어'].value_counts()

영어
70     2
85     1
100    1
75     1
Name: count, dtype: int64

In [15]:
df.shape

(5, 4)

In [16]:
df['영어'].nunique()

4

In [17]:
df['영어'].unique()

array([ 85, 100,  70,  75])

In [18]:
df.describe()

             ID     국어          영어    수학
count  5.000000    5.0    5.000000   4.0
mean   3.000000   85.0   80.000000  82.5
std    1.581139   10.0   12.747549  15.0
min    1.000000   75.0   70.000000  65.0
25%    2.000000   80.0   70.000000  72.5
50%    3.000000   80.0   75.000000  85.0
75%    4.000000   90.0   85.000000  95.0
max    5.000000  100.0  100.000000  95.0

In [19]:
df.sum()

ID     15.0
국어    425.0
영어    400.0
수학    330.0
dtype: float64

In [20]:
df[['국어', '영어', '수학']].sum()

국어    425.0
영어    400.0
수학    330.0
dtype: float64

In [21]:
df[['국어', '영어', '수학']].median()

국어    80.0
영어    75.0
수학    85.0
dtype: float64

In [22]:
df['수학'].std()

np.float64(15.0)

# 결측치 처리
* dropna() 함수는 결측치를 삭제
* fillna()는 결측치에 특정값을 채우는 함수

In [23]:
df.fillna(9999)

   ID   국어   영어      수학
0   1   80   85    75.0
1   2   90  100    95.0
2   3   75   70    65.0
3   4  100   70    95.0
4   5   80   75  9999.0

In [24]:
df.fillna(df['수학'].mean())

   ID   국어   영어    수학
0   1   80   85  75.0
1   2   90  100  95.0
2   3   75   70  65.0
3   4  100   70  95.0
4   5   80   75  82.5

# 열 생성
*

In [25]:
df = pd.DataFrame({"A":range(1, 13), "B":np.random.randint(0, 12, size=12)})
df.head()

   A   B
0  1   0
1  2   2
2  3   4
3  4  10
4  5   0

In [26]:
df.assign(plus=lambda x:df['A'] + df['B'])

     A   B  plus
0    1   0     1
1    2   2     4
2    3   4     7
3    4  10    14
4    5   0     5
5    6   7    13
6    7   9    16
7    8   0     8
8    9   4    13
9   10   1    11
10  11   3    14
11  12   9    21

In [29]:
df['plus_pu'] = df['A'] + df['B']

In [30]:
df

     A   B  plus  plus_pu
0    1   0     1        1
1    2   2     4        4
2    3   4     7        7
3    4  10    14       14
4    5   0     5        5
5    6   7    13       13
6    7   9    16       16
7    8   0     8        8
8    9   4    13       13
9   10   1    11       11
10  11   3    14       14
11  12   9    21       21

In [31]:
df = pd.DataFrame({"A":range(1, 13), "B":np.random.randint(0, 12, size=12)})
df['plus'] = df['A'] + df['B']

pd.qcut(df['plus'], 3, labels={"A", "B", "C"})

0     C
1     C
2     A
3     C
4     C
5     A
6     B
7     B
8     A
9     A
10    B
11    B
Name: plus, dtype: category
Categories (3, object): ['C' < 'A' < 'B']

In [33]:
df['category'] = pd.qcut(df['plus'], 3, labels={"A", "B", "C"})
df

     A   B  plus category
0    1   7     8        C
1    2   6     8        C
2    3   9    12        A
3    4   4     8        C
4    5   3     8        C
5    6   7    13        A
6    7  10    17        B
7    8   6    14        B
8    9   2    11        A
9   10   3    13        A
10  11  10    21        B
11  12   2    14        B

# 데이터 그룹화
* 데이터를 그룹화한다는 것은 데이터 프레임에서 필요한 기준에 따라 새롭게 데이터 프레임을 정렬하는 것
* 큰 데이터를 가져오기 위해 시각화 라이브러리 seaborn을 가져온다.

In [38]:
import seaborn as sns

df = sns.load_dataset("mpg")
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [39]:
df.groupby(by="origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [43]:
df.groupby(by="origin").min()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,16.2,4,68.0,46.0,1825,12.2,70,audi 100 ls
japan,18.0,3,70.0,52.0,1613,11.4,70,datsun 1200
usa,9.0,4,85.0,52.0,1800,8.0,70,amc ambassador brougham

In [46]:
df.groupby(by="origin").mean(numeric_only=True)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [47]:
df.groupby(by="origin")[["horsepower", "weight"]].mean()

        horsepower       weight
origin
europe   80.558824  2423.300000
japan    79.835443  2221.227848
usa     119.048980  3361.931727

## 순위를 구할 때 사용하는 rank()

In [48]:
df = sns.load_dataset("mpg")

print(df['cylinders'].unique())
display(df.head(3))
display(df.tail(3))

[8 4 6 3 5]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [57]:
df['cylinders'].rank(ascending=False,method='min')

0        1.0
1        1.0
2        1.0
3        1.0
4        1.0
       ...
393    191.0
394    191.0
395    191.0
396    191.0
397    191.0
Name: cylinders, Length: 398, dtype: float64

In [50]:
df['cylinders'].rank(method='dense')

0      5.0
1      5.0
2      5.0
3      5.0
4      5.0
      ...
393    2.0
394    2.0
395    2.0
396    2.0
397    2.0
Name: cylinders, Length: 398, dtype: float64

In [55]:
df['cylinders'].rank(ascending=False, method='dense')

0      1.0
1      1.0
2      1.0
3      1.0
4      1.0
      ...
393    4.0
394    4.0
395    4.0
396    4.0
397    4.0
Name: cylinders, Length: 398, dtype: float64

# 데이터 병합
* concat() 함수는 데이터를 이어 준다면 merge() 함수는 서로를 자연스럽게 융합시켜 주는 형태

In [59]:
adf = pd.DataFrame({"x1": ["A", "B", "C"], "x2": [1, 2, 3]})
bdf = pd.DataFrame({"x1": ["A", "B", "D"], "x3": ["T", "F", "T"]})

display(adf)
display(bdf)

  x1  x2
0  A   1
1  B   2
2  C   3

  x1 x3
0  A  T
1  B  F
2  D  T

In [60]:
pd.merge(adf, bdf, on='x1')

  x1  x2 x3
0  A   1  T
1  B   2  F

In [61]:
pd.merge(adf, bdf, how='right', on='x1')

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [62]:
pd.merge(adf, bdf, how='left', on='x1')

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [63]:
pd.merge(adf, bdf, how='outer', on='x1')

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

# 경기도 인구 데이터 분석
https://data.gg.go.kr/portal/data/service/selectServicePage.do?page=1&sortColumn=&sortDirection=&infId=HH7N68ZBMYNCB7QE9OY927342034&infSeq=1&searchWord=%EC%A3%BC%EB%AF%BC%EB%93%B1%EB%A1%9D%EC%9D%B8%EA%B5%AC+%EC%A7%91%EA%B3%84+%ED%98%84%ED%99%A9

In [71]:
import pandas as pd

import matplotlib.pyplot as plt

%matplotlib inline

plt.rc('font', family='Malgun Gothic')
plt.rcParams['axes.unicode_minus'] = False

import IPython.display
from matplotlib_inline.backend_inline import set_matplotlib_formats
IPython.display.set_matplotlib_formats = set_matplotlib_formats('retina')

In [73]:
filepath = 'C:/Users/hisem/Desktop/DataAnalysisPython/1장/data/주민등록인구집계현황.csv'
population = pd.read_csv(filepath, encoding='euc-kr')
population.head(2)

,연도,월,행정구역구분명,행정구역명,총 인구수,0~9세,10~19세,20~29세,30~39세,40~49세,...,10~19세 (여),20~29세 (여),30~39세 (여),40~49세 (여),50~59세 (여),60~69세 (여),70~79세 (여),80~89세 (여),90~99세 (여),100세 이상 (여)
0,2025,3,도,경기도,13699381,924977,1318877,1607769,1907714,2204472,...,644589,766025,909222,1079017,1171936,962801,499742,275291,54419,1559
1,2025,3,시군,경기도 가평군,62234,2589,4152,5400,5462,6977,...,2027,2309,2448,3282,4983,6639,4185,2513,498,20

In [74]:
print("데이터 크기 :", population.shape)

데이터 크기 : (126740, 40)

In [75]:
population.isnull().sum()

연도             0
월              0
행정구역구분명        0
행정구역명          0
총 인구수          0
0~9세           0
10~19세         0
20~29세         0
30~39세         0
40~49세         0
50~59세         0
60~69세         0
70~79세         0
80~89세         0
90~99세         0
100세 이상        0
총 인구수 (남)      0
0~9세 (남)       0
10~19세 (남)     0
20~29세 (남)     0
30~39세 (남)     0
40~49세 (남)     0
50~59세 (남)     0
60~69세 (남)     0
70~79세 (남)     0
80~89세 (남)     0
90~99세 (남)     0
100세 이상 (남)    0
총 인구수 (여)      0
0~9세 (여)       0
10~19세 (여)     0
20~29세 (여)     0
30~39세 (여)     0
40~49세 (여)     0
50~59세 (여)     0
60~69세 (여)     0
70~79세 (여)     0
80~89세 (여)     0
90~99세 (여)     0
100세 이상 (여)    0
dtype: int64

### 젊은 세대가 많이 사는 지역이 어디인지 정의
* 40대 이하 여성이 많이 사는 지역을 젊은 세대가 많이 사는 지역으로 정의
* 40대 이하 여성이 지역 맘카페에 가입하고, 학령기에 들어선 아이들의 학부모이기 때문

10대와 40대가 함께 살고 있으므로 해당 지역은 전체적으로 젊은 지역으로 간주할 수 있음

In [76]:
popula_female = population.iloc[:, -12:]

popula_info = population.iloc[:, :4]

pop_female_info = pd.concat([popula_info, popula_female], axis=1)

In [77]:
pop_female_info['연도'].value_counts().sort_index()

연도
2008    8066
2009    7088
2010    7100
2011    7140
2012    7169
2013    7195
2014    7246
2015    7307
2016    7326
2017    7300
2018    7335
2019    7214
2020    7167
2021    7276
2022    7417
2023    7500
2024    7914
2025    1980
Name: count, dtype: int64

In [78]:
pop_female_info = pop_female_info[pop_female_info['연도'] != 2025]

In [79]:
pop_female_info.rename(columns={"0~9세 (여)": "10대_미만",
                                "10~19세 (여)": "10대",
                                "20~29세 (여)": "20대",
                                "30~39세 (여)": "30대",
                                "40~49세 (여)": "40대",
                                "50~59세 (여)": "50대",
                                "60~69세 (여)": "60대"
                                }, inplace=True)

In [81]:
pop_female_info['70대_이상'] = pop_female_info["70~79세 (여)"] + \
                                pop_female_info["80~89세 (여)"] + \
                                pop_female_info["90~99세 (여)"] + \
                                pop_female_info["100세 이상 (여)"]
pop_female_info.info()

<class 'pandas.core.frame.DataFrame'>
Index: 124760 entries, 1980 to 126739
Data columns (total 17 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   연도           124760 non-null  int64
 1   월            124760 non-null  int64
 2   행정구역구분명      124760 non-null  object
 3   행정구역명        124760 non-null  object
 4   총 인구수 (여)    124760 non-null  int64
 5   10대_미만       124760 non-null  int64
 6   10대          124760 non-null  int64
 7   20대          124760 non-null  int64
 8   30대          124760 non-null  int64
 9   40대          124760 non-null  int64
 10  50대          124760 non-null  int64
 11  60대          124760 non-null  int64
 12  70~79세 (여)   124760 non-null  int64
 13  80~89세 (여)   124760 non-null  int64
 14  90~99세 (여)   124760 non-null  int64
 15  100세 이상 (여)  124760 non-null  int64
 16  70대_이상       124760 non-null  int64
dtypes: int64(15), object(2)
memory usage: 17.1+ MB

In [82]:
df_female = pop_female_info.drop(['70~79세 (여)', '80~89세 (여)', '90~99세 (여)', '100세 이상 (여)'], axis=1)
df_female.head(2)

,연도,월,행정구역구분명,행정구역명,총 인구수 (여),10대_미만,10대,20대,30대,40대,50대,60대,70대_이상
1980,2024,12,도,경기도,6812499,458844,644297,774543,909829,1084852,1170670,957531,811933
1981,2024,12,시군,경기도 가평군,30333,1306,2055,2369,2477,3324,5010,6726,7066

행정구역 중에 면, 리는 시골 지역이기 때문에 당연히 40대 이하 인구가 많이 살고 있지 않음 \
행정구역구분면에 '동'을 포함한 행만 가져온다.

In [83]:
df_female_dong = df_female[df_female['행정구역명'].str.contains('동')]
df_female_dong.head()

,연도,월,행정구역구분명,행정구역명,총 인구수 (여),10대_미만,10대,20대,30대,40대,50대,60대,70대_이상
1990,2024,12,읍면동,경기도 고양시 덕양구 고양동,13843,632,1300,1404,1159,2018,2574,2264,2492
1991,2024,12,읍면동,경기도 고양시 덕양구 관산동,16776,590,1175,1484,1438,2155,3212,3470,3252
1992,2024,12,읍면동,경기도 고양시 덕양구 능곡동,8788,498,595,933,1203,1155,1767,1444,1193
1993,2024,12,읍면동,경기도 고양시 덕양구 대덕동,8199,1175,797,836,1684,1580,1034,648,445
1994,2024,12,읍면동,경기도 고양시 덕양구 삼송1동,11602,915,812,1599,2392,1921,1677,1319,967

__대 이하 여성들의 비율 = __대 이하 인구 합계 ÷ 해당 지역 전체 인구수 × 100

In [88]:
under40s = df_female_dong['10대_미만'] + df_female_dong['10대'] + df_female_dong['20대'] + df_female_dong['30대'] + df_female_dong['40대']
over50s = df_female_dong['50대'] + df_female_dong['60대'] + df_female_dong['70대_이상']

under40_percent = round((under40s/df_female_dong['총 인구수 (여)']*100), 2)
over50_percent = round((over50s/df_female_dong['총 인구수 (여)']*100), 2)

df_female_dong['40대_이하_여성비율(%)'] = under40_percent
df_female_dong['50대_이상_여성비율(%)'] = over50_percent

df_female_dong[df_female_dong['연도']==2024]

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_19832\455539071.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_dong['40대_이하_여성비율(%)'] = under40_percent
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_19832\455539071.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_dong['50대_이상_여성비율(%)'] = over50_percent

,연도,월,행정구역구분명,행정구역명,총 인구수 (여),10대_미만,10대,20대,30대,40대,50대,60대,70대_이상,40대_이하_여성비율(%),50대_이상_여성비율(%)
1990,2024,12,읍면동,경기도 고양시 덕양구 고양동,13843,632,1300,1404,1159,2018,2574,2264,2492,47.05,52.95
1991,2024,12,읍면동,경기도 고양시 덕양구 관산동,16776,590,1175,1484,1438,2155,3212,3470,3252,40.78,59.22
1992,2024,12,읍면동,경기도 고양시 덕양구 능곡동,8788,498,595,933,1203,1155,1767,1444,1193,49.89,50.11
1993,2024,12,읍면동,경기도 고양시 덕양구 대덕동,8199,1175,797,836,1684,1580,1034,648,445,74.06,25.94
1994,2024,12,읍면동,경기도 고양시 덕양구 삼송1동,11602,915,812,1599,2392,1921,1677,1319,967,65.84,34.16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9881,2024,1,읍면동,경기도 화성시 새솔동,12892,2015,1673,1072,2336,2715,1832,917,332,76.10,23.90
9888,2024,1,읍면동,경기도 화성시 진안동,23102,2484,2079,2904,4585,4003,3267,2199,1581,69.50,30.50
9891,2024,1,읍면동,경기도 화성시 화산동,12839,919,1086,1535,1794,2009,2253,1821,1422,57.19,42.81
9892,2024,1,읍면동,경기도 화성시동부출장소,0,0,0,0,0,0,0,0,0,NaN,NaN
9893,2024,1,읍면동,경기도 화성시동탄출장소,0,0,0,0,0,0,0,0,0,NaN,NaN

행정구역명 -> 시와 동으로 분리 \
split() 함수 사용

In [89]:
x = "경기도 고양시 덕양구 고양동"
print("split() 적용 전:", x)
print("split() 적용 후", x.split())
print("동 추출 결과 :", x.split()[-1])
print("시 추출 결과 :", x.split()[1])

split() 적용 전: 경기도 고양시 덕양구 고양동
split() 적용 후 ['경기도', '고양시', '덕양구', '고양동']
동 추출 결과 : 고양동
시 추출 결과 : 고양시

In [90]:
df_female_dong['동'] = df_female_dong['행정구역명'].apply(lambda x:x.split()[-1])
df_female_dong['시'] = df_female_dong['행정구역명'].apply(lambda x:x.split()[1])

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_19832\3028778278.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_dong['동'] = df_female_dong['행정구역명'].apply(lambda x:x.split()[-1])
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_19832\3028778278.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_dong['시'] = df_female_dong['행정구역명'].apply(lambda x:x.split()[1])

In [91]:
df_female_dong.sample()

,연도,월,행정구역구분명,행정구역명,총 인구수 (여),10대_미만,10대,20대,30대,40대,50대,60대,70대_이상,40대_이하_여성비율(%),50대_이상_여성비율(%),동,시
67320,2016,2,읍면동,경기도 김포시 사우동,10814,836,1241,1497,1381,2129,1766,932,1032,65.51,34.49,사우동,김포시

시와 동 정보는 하나로 다시 합쳐서 열 추가 \
경기도에 시는 다르지만 동 이름이 같은 경우가 있기 때문

In [93]:
df_female_dong['시-동'] = df_female_dong['시'] + " " + df_female_dong['동']
df_result = df_female_dong[['연도', '시', '동', '시-동', '총 인구수 (여)', '40대_이하_여성비율(%)', '50대_이상_여성비율(%)']]
df_result.isnull().sum()

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_19832\1485836421.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_female_dong['시-동'] = df_female_dong['시'] + " " + df_female_dong['동']

연도                  0
시                   0
동                   0
시-동                 0
총 인구수 (여)           0
40대_이하_여성비율(%)    108
50대_이상_여성비율(%)    108
dtype: int64

데이터 프레임 전체에 연산을 적용하거나 필요한 데이터를 추출할 때마다 결측치를 확인해야 합니다.

In [94]:
df_result[df_result['40대_이하_여성비율(%)'].isnull()]

,연도,시,동,시-동,총 인구수 (여),40대_이하_여성비율(%),50대_이상_여성비율(%)
2638,2024,화성시동부출장소,화성시동부출장소,화성시동부출장소 화성시동부출장소,0,NaN,NaN
2639,2024,화성시동탄출장소,화성시동탄출장소,화성시동탄출장소 화성시동탄출장소,0,NaN,NaN
3298,2024,화성시동부출장소,화성시동부출장소,화성시동부출장소 화성시동부출장소,0,NaN,NaN
3299,2024,화성시동탄출장소,화성시동탄출장소,화성시동탄출장소 화성시동탄출장소,0,NaN,NaN
3958,2024,화성시동부출장소,화성시동부출장소,화성시동부출장소 화성시동부출장소,0,NaN,NaN
...,...,...,...,...,...,...,...
32690,2020,화성시동탄출장소,화성시동탄출장소,화성시동탄출장소 화성시동탄출장소,0,NaN,NaN
33290,2020,화성시동부출장소,화성시동부출장소,화성시동부출장소 화성시동부출장소,0,NaN,NaN
33291,2020,화성시동탄출장소,화성시동탄출장소,화성시동탄출장소 화성시동탄출장소,0,NaN,NaN
33891,2020,화성시동부출장소,화성시동부출장소,화성시동부출장소 화성시동부출장소,0,NaN,NaN
33892,2020,화성시동탄출장소,화성시동탄출장소,화성시동탄출장소 화성시동탄출장소,0,NaN,NaN

In [95]:
df_result.dropna(inplace=True)
df_result = df_result[df_result['연도']>2015]
df_result.sample(3)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_19832\2160674557.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_result.dropna(inplace=True)

         연도    시     동       시-동  총 인구수 (여)  40대_이하_여성비율(%)  50대_이상_여성비율(%)
45918  2019  광명시  광명4동  광명시 광명4동       7472           53.72           46.28
63697  2016  부천시   상3동   부천시 상3동      16894           74.59           25.41
40078  2019  수원시  망포1동  수원시 망포1동      15971           73.88           26.12

In [ ]:
df_resent_group = df_result.groupby(['시-동'])['40대_이하_여성비율(%)', '50대_이상_여성비율(%)'].mean()
df_resent_group.reset_index(inplace=True)
df_resent_group.sort_values(by='40대_이하_여성비율(%)', ascending=False)[:20]

ValueError: Cannot subset columns with a tuple with more than one element. Use a list instead.